
"Copy button:" = "Kopioi-painike:";
"Mail button:" = "Sähköposti-painike:";
"Scan button:" = "Skannaa-painike:";
"Scan-To-Web button:" = "Skannaa Webiin -painike:";
//Custom control UI strings
"Descreen" = "Rasteripisteiden poisto";
"Color Restoration" = "Värien palautus";
"Adaptive Lighting" = "Mukautuva valaistus";
"Unsharp Mask" = "Epäterävä maski";
"Remove Dust"   = "Pölyn poisto";
"6-Color Scanning" = "6-väriskannaus";


"Tooltip_Descreen" = "Poista rasterointikuviot (moiré)";
"Tooltip_ColorRestoration" = "Palauta haalistuneet värit";
"Tooltip_AdaptiveLight" = "Säädä valotustasoja automaattisesti";
"Tooltip_Sharpen" = "Lisää terävyyttä";

//Cusom control  menu items
"None" = "Ei mitään";
"Low" = "Matala";
"Medium" = "Keskitaso";
"High" = "Korkea";
"Extreme" = "Äärimmäinen";

"Resolution" = "Tarkkuus";
"Source Size" = "Lähdekoko";
"New Size" = "Uusi koko";
"Negative Number" = "Negatiivi %d";
"Slide Number" = "Dia %d";
"HP ICA Scan" = "HP:n ICA-skannaus";
"Install HP Devices" = "Asentaa komponentit, joita HP-laitteet tarvitsevat voidakseen skannata Image Capture -ohjelmaa käyttäen.";
"Communication error" = "Tiedonsiirtovirhe";
"Communication error while scanning" = "Kommunikoitaessa laitteen kanssa tapahtui virhe. Varmista että laite on päällä ja oikein liitetty.";
"Image Save Error" = "Kuvan tallennusvirhe";
"Image Format Mismatch" = "Automaattinen tehtävä -kohdassa valittu sovellus ei tue valittua tiedostomuotoa. Valitse jokin muu sovellus tai muoto.";
"Disk full error" = "Levy täynnä -virhe";
"Disk full error String Description" = "Valittu levy on täynnä. Tallenna tiedosto eri levylle tai poista tiedostoja tilan vapauttamiseksi.";
"Permissions Error" = "Käyttöoikeusvirhe";
"Permission Error Description" = "Sinulla ei ole oikeutta tallentaa tiedostoja kohteeseen \"%@\". Tallenna johonkin muuhun sijaintiin.";
"Invalid value" = "Virheellinen arvo";
"Invalid value description" = "%@-kentässä määritetty arvo on virheellinen. Määritä arvo väliltä %ld - %ld ja yritä skannata uudelleen.";
"Image size is too long" = "Kuvan koko on liian suuri. Pienennä kuvan korkeutta, leveyttä, tarkkuutta, skaalausta tai tyyppiä.";
"Read error" = "Lukuvirhe";
"Read error Description" = "Virhe haettaessa skannattua kohdetta laitteesta. Yritä uudelleen.";
"Installation Problem" = "Tarvittava ohjelmistokomponentti puuttuu tai on korruptoitunut. Asenna laitteen ohjelmisto uudelleen ja/tai tarkista, ettei kiintolevyssä ole ongelmia.";
"Document feeder error" = "Asiakirjojen syöttölaitteen virhe";
"Paper Jam Description One" = "Automaattisessa asiakirjojen syöttölaitteessa on paperitukos. Saat ohjeita paperitukoksen poistamiseen laitteen mukana toimitetuista oppaista.";
"Paper Jam Description Two" = "Automaattinen dokumentin syöttölaite on jumissa tai se ei pysty hakemaan paperia. Ota paperipinkka käteen, ravistele sitä ja aseta se takaisin dokumentin syöttölaitteeseen. Lisätietoja on laitteen dokumentaatiossa.";
"Paper Jam Description Three" = "Automaattisen dokumentin syöttölaitteen salpa ei ole kunnolla kiinni. Kiinnitä salpa painamalla sitä alaspäin kunnes kuulet napsahduksen. Yritä sitten skannausta uudelleen.";
"Document feeder empty" = "Asiakirjojen syöttölaite tyhjä";
"Document feeder empty description One" = "Automaattinen asiakirjojen syöttölaite ei havainnut asiakirjoja. Aseta alkuperäiset asiakirjat oikein automaattiseen asiakirjojen syöttölaitteeseen.";
"Document feeder empty description Two" = "Alkuperäiset asiakirjat poistettiin automaattisesta asiakirjojen syöttölaitteesta. Aseta ne uudelleen ja jatka skannausta.";
"ADF Duplex error" = "Automaattinen asiakirjojen syöttölaite ei voi skannata molempia puolia asiakirjasta, joka on yli 12 tuumaa pitkä.";
"Transparent Media Adapter Error" = "Kalvomateriaalisovittimen virhe";
"Transparent Media Adapter Error Description One" ="Skannausta ei voitu suorittaa loppuun, koska kalvomateriaalisovitinta ei löytynyt. Jos kalvomateriaalisovitin on käytössä, tarkista, että se on kytketty tukevasti skanneriin ja yritä sitten uudelleen.";
"Transparent Media Adapter Error Description Two" = "Varmista, että kalvomateriaalisovitin on kytketty tukevasti ja sijoitettu oikein. Jos laite käyttää asettelulevyä, varmista, että levyn merkintä on kohdakkain skannerin merkinnän kanssa ja yritä skannata uudelleen.";
"Transparent Media Adapter Error Description Three" = "Kalvomateriaalisovittimen suojus on poistettava skannerin kannesta. Jos se on poistettu, varmista, että malli on asetettu oikein skannaustasolle. Jos et käytä mallia, varmista, että kannen kalibrointi-ikkunaa ei ole peitetty. Aseta skannattava materiaali n. 4 cm (1,5 tuumaa) skannausason yläreunasta alaspäin.";
"Transparent Media Adapter Error Description Four" = "Poista alkuperäiset asiakirjat skannaustasolta. Varmista myös, että kalvomateriaalisovitin on kytketty tukevasti ja sijoitettu oikein.";
"Transparent Media Adapter Error Description Five" = "Ohjelma on asetettu skannaamaan dia (positiivi), mutta se havaitsi negatiivin. Vaihda asiakirjan tyypiksi Negatiivi.";
"Transparent Media Adapter Error Description Six" = "Ohjelma on asetettu skannaamaan negatiivi, mutta se havaitsi dian (positiivi). Vaihda asiakirjan tyypiksi Väridia tai Positiivi.";
"Transparent Media Adapter Error Description Seven" = "Kalvomateriaalisovitin ei tunnistanut määritettyä materiaalia. Varmista, että materiaali on asetettu oikein sovittimeen ja että olet valinnut skannaamallesi materiaalille sopivan materiaalityypin (Positiivi tai Negatiivi).";
"Transparent Media Adapter Error Description Eight" = "Skanneri ei voi suorittaa kalvomateriaaliskannausta juuri nyt. Odota, kunnes skanneri vapautuu ja yritä uudelleen.";
"Scan Cancelled" = "Skannaus peruutettu";
"Scan Cancelled Description" = "Skannausta ei voitu suorittaa, koska toiminto peruutettiin skannaamisen aikana.";
"Device Busy" ="Laite varattu";
"Device Busy Description" = "Jokin toinen sovellus käyttää skanneria. Poistu muista skannausohjelmista ja yritä uudelleen.";
"Device Busy Description Network" = "Toimintoa ei voitu suorittaa, koska valittu verkkolaite on varattuna. Yritä uudelleen."; 

"Image Capture Scan" = "Image Capture -skannaus";
"Sharpen" = "Terävöitä";
"6-Color Scan" = "6-väriskannaus";
"Missing or Damaged Software" = "Ohjelmisto puuttuu tai on vahingoittunut";
"One or more components needed by Image Capture is missing or damaged. Please reinstall the software for your HP device." = "Yksi tai useampi Image Capture -ohjelman tarvitsema komponentti puuttuu tai on vahingoittunut. Asenna HP-laitteen ohjelmisto uudelleen.";
"File name too long" = "Tiedostonimi liian pitkä";
"The file could not be saved because the filename is too long. Please enter a shorter name and try again." = "Tiedostoa ei voi tallentaa, koska tiedostonimi on liian pitkä. Anna lyhyempi nimi ja yritä uudelleen.";
"Warning: File name starts with a period" = "Varoitus: tiedostonimi alkaa pisteellä";
"The filename you have entered begins with a period (.). If you continue, the file will be saved as a hidden file and will not be visible in the Finder. To correct this, remove the period from the start of the filename." = "Antamasi tiedostonimi alkaa pisteellä (.). Jos jatkat, tiedosto tallennetaan piilotiedostona, eikä se näy tiedostojen etsimessä. Korjaa ongelma poistamalla piste tiedostonimen alusta.";
"Error Saving Image" = "Virhe tallennettaessa kuvaa";
"Image Capture has encountered an unknown error. The image could not be saved. Please try again." = "Image Capture kohtasi tuntemattoman virheen. Kuvaa ei voitu tallentaa. Yritä uudelleen.";

"ADF_OUT_OF_PAPER_MESSAGE" = "Automaattisessa dokumentin syöttölaitteessa ei havaittu kohteita. Aseta alkuperäiskappaleet automaattiseen dokumentin syöttölaitteeseen ja aloita skannaaminen uudelleen.";

// Added on the 6-June-08
"Last overview scan was cancelled, please overview it again and then scan" = "Viimeisin esiskannaus peruutettiin, esiskannaa asiakirja uudelleen ja skannaa se sitten";
"Templates" = "Mallit";

"DEVICE_BUSY" = "Laite on varattu";
"DEVICE_BUSY_DESCRIPTION" = "Laite on tällä hetkellä käytössä. Odota, että edellinen tehtävä on valmis ja yritä sitten skannaamista uudelleen.";

// Vendor Feature related
"Automatic" = "Automaattinen";
"Picture" = "Kuva";
"Document" = "Dokumentti";
"Three-Dimensional Objects" = "Kolmiulotteinen kohde";
"Tooltip_Type" = "Määritä skannattavien kohteiden tyyppi. Valitse \"Automaattinen\", jos haluat käyttää useimpiin kohteisiin sopivia esimääritettyjä skannausasetuksia.";
"Type" = "Tyyppi:";

// Button handling
"Scan failed" = "Skannaus epäonnistui";
